Tekla Open API Reference for Tekla Structures 2025
Critical Methods
The TaskFilterExpressions.Critical type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
TaskFilterExpressions.Critical Class
Tekla.Structures.Filtering.Categories Namespace